package main.java.ua.bolzhelarskii.Car;
//- с полями: серия, год, цвет, размер бака, текущее топливо, потребление топлива
// - с методами:
//I) движение (движется пока есть топливо),
// II) метод показать статистику
// - добавить конструктор на все поля
//b) Создать дочерний класс passenger car
// - добавить поле класс passenger
// - добавить метод посадить пассажира (в машине не может быть более 3
//пассажиров)
//c) Создать дочерний класс truck
// - добавить поле cargo
// - добавить метод погрузки и выгрузки груза
// - переопределить метод движения (потребления топлива х2 от нормы)
//d) Создать интерфейс Recovery с методом refuel (восстанавливает топливо машины
//до полного значения)
//e) Имплементировать интерфейс в созданных ранее типах маши
public class Car {
    private int serial;
    private int year;
    private String color;
    private int gasTankSize;
    private double currentFuel;
    private double fuelConsumption;
}
